Revit 2024 API
FillPattern.IsEqual Method
 Check if the contents and the name of the fill pattern is the same as the name and contents of this fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsEqual(
	FillPattern other
)
Visual Basic
Public Function IsEqual ( _
	other As FillPattern _
) As Boolean
Visual C++
public:
bool IsEqual(
	FillPattern^ other
)
Parameters
other
Type: Autodesk.Revit.DB.FillPattern
 The fill pattern to be compared.
Return Value
 True for equal, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FillPattern Class
Autodesk.Revit.DB Namespace